apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_pmu.h
/*********************************************************************************
 * arch/arm/src/imxrt/hardware/rt117x/imxrt117x_pmu.h
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 *********************************************************************************/

/* Copyright 2022 NXP */

#ifndef __ARCH_ARM_SRC_IMXRT_HARDWARE_RT117X_IMXRT117X_PMU_H
#define __ARCH_ARM_SRC_IMXRT_HARDWARE_RT117X_IMXRT117X_PMU_H

/*********************************************************************************
 * Included Files
 *********************************************************************************/

#include <nuttx/config.h>
#include "hardware/imxrt_memorymap.h"

/*********************************************************************************
 * Pre-processor Definitions
 *********************************************************************************/

/* ANADIG_PMU Register Offsets ***************************************************/
#define IMXRT_ANADIG_PMU_PMU_LDO_PLL_OFFSET                  (0x0500)
#define IMXRT_ANADIG_PMU_PMU_BIAS_CTRL_OFFSET                (0x0550)
#define IMXRT_ANADIG_PMU_PMU_BIAS_CTRL2_OFFSET               (0x0560)
#define IMXRT_ANADIG_PMU_PMU_REF_CTRL_OFFSET                 (0x0570)
#define IMXRT_ANADIG_PMU_PMU_POWER_DETECT_CTRL_OFFSET        (0x0580)
#define IMXRT_ANADIG_PMU_LDO_PLL_ENABLE_SP_OFFSET            (0x0600)
#define IMXRT_ANADIG_PMU_LDO_LPSR_ANA_ENABLE_SP_OFFSET       (0x0610)
#define IMXRT_ANADIG_PMU_LDO_LPSR_ANA_LP_MODE_SP_OFFSET      (0x0620)
#define IMXRT_ANADIG_PMU_LDO_LPSR_ANA_TRACKING_EN_SP_OFFSET  (0x0630)
#define IMXRT_ANADIG_PMU_LDO_LPSR_ANA_BYPASS_EN_SP_OFFSET    (0x0640)
#define IMXRT_ANADIG_PMU_LDO_LPSR_ANA_STBY_EN_SP_OFFSET      (0x0650)
#define IMXRT_ANADIG_PMU_LDO_LPSR_DIG_ENABLE_SP_OFFSET       (0x0660)
#define IMXRT_ANADIG_PMU_LDO_LPSR_DIG_TRG_SP0_OFFSET         (0x0670)
#define IMXRT_ANADIG_PMU_LDO_LPSR_DIG_TRG_SP1_OFFSET         (0x0680)
#define IMXRT_ANADIG_PMU_LDO_LPSR_DIG_TRG_SP2_OFFSET         (0x0690)
#define IMXRT_ANADIG_PMU_LDO_LPSR_DIG_TRG_SP3_OFFSET         (0x06a0)
#define IMXRT_ANADIG_PMU_LDO_LPSR_DIG_LP_MODE_SP_OFFSET      (0x06b0)
#define IMXRT_ANADIG_PMU_LDO_LPSR_DIG_TRACKING_EN_SP_OFFSET  (0x06c0)
#define IMXRT_ANADIG_PMU_LDO_LPSR_DIG_BYPASS_EN_SP_OFFSET    (0x06d0)
#define IMXRT_ANADIG_PMU_LDO_LPSR_DIG_STBY_EN_SP_OFFSET      (0x06e0)
#define IMXRT_ANADIG_PMU_BANDGAP_ENABLE_SP_OFFSET            (0x06f0)
#define IMXRT_ANADIG_PMU_FBB_M7_ENABLE_SP_OFFSET             (0x0700)
#define IMXRT_ANADIG_PMU_RBB_SOC_ENABLE_SP_OFFSET            (0x0710)
#define IMXRT_ANADIG_PMU_RBB_LPSR_ENABLE_SP_OFFSET           (0x0720)
#define IMXRT_ANADIG_PMU_BANDGAP_STBY_EN_SP_OFFSET           (0x0730)
#define IMXRT_ANADIG_PMU_PLL_LDO_STBY_EN_SP_OFFSET           (0x0740)
#define IMXRT_ANADIG_PMU_FBB_M7_STBY_EN_SP_OFFSET            (0x0750)
#define IMXRT_ANADIG_PMU_RBB_SOC_STBY_EN_SP_OFFSET           (0x0760)
#define IMXRT_ANADIG_PMU_RBB_LPSR_STBY_EN_SP_OFFSET          (0x0770)
#define IMXRT_ANADIG_PMU_FBB_M7_CONFIGURE_OFFSET             (0x0780)
#define IMXRT_ANADIG_PMU_RBB_LPSR_CONFIGURE_OFFSET           (0x0790)
#define IMXRT_ANADIG_PMU_RBB_SOC_CONFIGURE_OFFSET            (0x07a0)
#define IMXRT_ANADIG_PMU_REFTOP_OTP_TRIM_VALUE_OFFSET        (0x07b0)
#define IMXRT_ANADIG_PMU_LPSR_1P8_LDO_OTP_TRIM_VALUE_OFFSET  (0x07d0)

/* ANADIG_PMU Register Addresses *************************************************/
#define IMXRT_ANADIG_PMU_PMU_LDO_PLL                  (IMXRT_ANADIG_BASE + IMXRT_ANADIG_PMU_PMU_LDO_PLL_OFFSET)
#define IMXRT_ANADIG_PMU_PMU_BIAS_CTRL                (IMXRT_ANADIG_BASE + IMXRT_ANADIG_PMU_PMU_BIAS_CTRL_OFFSET)
#define IMXRT_ANADIG_PMU_PMU_BIAS_CTRL2               (IMXRT_ANADIG_BASE + IMXRT_ANADIG_PMU_PMU_BIAS_CTRL2_OFFSET)
#define IMXRT_ANADIG_PMU_PMU_REF_CTRL                 (IMXRT_ANADIG_BASE + IMXRT_ANADIG_PMU_PMU_REF_CTRL_OFFSET)
#define IMXRT_ANADIG_PMU_PMU_POWER_DETECT_CTRL        (IMXRT_ANADIG_BASE + IMXRT_ANADIG_PMU_PMU_POWER_DETECT_CTRL_OFFSET)
#define IMXRT_ANADIG_PMU_LDO_PLL_ENABLE_SP            (IMXRT_ANADIG_BASE + IMXRT_ANADIG_PMU_LDO_PLL_ENABLE_SP_OFFSET)
#define IMXRT_ANADIG_PMU_LDO_LPSR_ANA_ENABLE_SP       (IMXRT_ANADIG_BASE + IMXRT_ANADIG_PMU_LDO_LPSR_ANA_ENABLE_SP_OFFSET)
#define IMXRT_ANADIG_PMU_LDO_LPSR_ANA_LP_MODE_SP      (IMXRT_ANADIG_BASE + IMXRT_ANADIG_PMU_LDO_LPSR_ANA_LP_MODE_SP_OFFSET)
#define IMXRT_ANADIG_PMU_LDO_LPSR_ANA_TRACKING_EN_SP  (IMXRT_ANADIG_BASE + IMXRT_ANADIG_PMU_LDO_LPSR_ANA_TRACKING_EN_SP_OFFSET)
#define IMXRT_ANADIG_PMU_LDO_LPSR_ANA_BYPASS_EN_SP    (IMXRT_ANADIG_BASE + IMXRT_ANADIG_PMU_LDO_LPSR_ANA_BYPASS_EN_SP_OFFSET)
#define IMXRT_ANADIG_PMU_LDO_LPSR_ANA_STBY_EN_SP      (IMXRT_ANADIG_BASE + IMXRT_ANADIG_PMU_LDO_LPSR_ANA_STBY_EN_SP_OFFSET)
#define IMXRT_ANADIG_PMU_LDO_LPSR_DIG_ENABLE_SP       (IMXRT_ANADIG_BASE + IMXRT_ANADIG_PMU_LDO_LPSR_DIG_ENABLE_SP_OFFSET)
#define IMXRT_ANADIG_PMU_LDO_LPSR_DIG_TRG_SP0         (IMXRT_ANADIG_BASE + IMXRT_ANADIG_PMU_LDO_LPSR_DIG_TRG_SP0_OFFSET)
#define IMXRT_ANADIG_PMU_LDO_LPSR_DIG_TRG_SP1         (IMXRT_ANADIG_BASE + IMXRT_ANADIG_PMU_LDO_LPSR_DIG_TRG_SP1_OFFSET)
#define IMXRT_ANADIG_PMU_LDO_LPSR_DIG_TRG_SP2         (IMXRT_ANADIG_BASE + IMXRT_ANADIG_PMU_LDO_LPSR_DIG_TRG_SP2_OFFSET)
#define IMXRT_ANADIG_PMU_LDO_LPSR_DIG_TRG_SP3         (IMXRT_ANADIG_BASE + IMXRT_ANADIG_PMU_LDO_LPSR_DIG_TRG_SP3_OFFSET)
#define IMXRT_ANADIG_PMU_LDO_LPSR_DIG_LP_MODE_SP      (IMXRT_ANADIG_BASE + IMXRT_ANADIG_PMU_LDO_LPSR_DIG_LP_MODE_SP_OFFSET)
#define IMXRT_ANADIG_PMU_LDO_LPSR_DIG_TRACKING_EN_SP  (IMXRT_ANADIG_BASE + IMXRT_ANADIG_PMU_LDO_LPSR_DIG_TRACKING_EN_SP_OFFSET)
#define IMXRT_ANADIG_PMU_LDO_LPSR_DIG_BYPASS_EN_SP    (IMXRT_ANADIG_BASE + IMXRT_ANADIG_PMU_LDO_LPSR_DIG_BYPASS_EN_SP_OFFSET)
#define IMXRT_ANADIG_PMU_LDO_LPSR_DIG_STBY_EN_SP      (IMXRT_ANADIG_BASE + IMXRT_ANADIG_PMU_LDO_LPSR_DIG_STBY_EN_SP_OFFSET)
#define IMXRT_ANADIG_PMU_BANDGAP_ENABLE_SP            (IMXRT_ANADIG_BASE + IMXRT_ANADIG_PMU_BANDGAP_ENABLE_SP_OFFSET)
#define IMXRT_ANADIG_PMU_FBB_M7_ENABLE_SP             (IMXRT_ANADIG_BASE + IMXRT_ANADIG_PMU_FBB_M7_ENABLE_SP_OFFSET)
#define IMXRT_ANADIG_PMU_RBB_SOC_ENABLE_SP            (IMXRT_ANADIG_BASE + IMXRT_ANADIG_PMU_RBB_SOC_ENABLE_SP_OFFSET)
#define IMXRT_ANADIG_PMU_RBB_LPSR_ENABLE_SP           (IMXRT_ANADIG_BASE + IMXRT_ANADIG_PMU_RBB_LPSR_ENABLE_SP_OFFSET)
#define IMXRT_ANADIG_PMU_BANDGAP_STBY_EN_SP           (IMXRT_ANADIG_BASE + IMXRT_ANADIG_PMU_BANDGAP_STBY_EN_SP_OFFSET)
#define IMXRT_ANADIG_PMU_PLL_LDO_STBY_EN_SP           (IMXRT_ANADIG_BASE + IMXRT_ANADIG_PMU_PLL_LDO_STBY_EN_SP_OFFSET)
#define IMXRT_ANADIG_PMU_FBB_M7_STBY_EN_SP            (IMXRT_ANADIG_BASE + IMXRT_ANADIG_PMU_FBB_M7_STBY_EN_SP_OFFSET)
#define IMXRT_ANADIG_PMU_RBB_SOC_STBY_EN_SP           (IMXRT_ANADIG_BASE + IMXRT_ANADIG_PMU_RBB_SOC_STBY_EN_SP_OFFSET)
#define IMXRT_ANADIG_PMU_RBB_LPSR_STBY_EN_SP          (IMXRT_ANADIG_BASE + IMXRT_ANADIG_PMU_RBB_LPSR_STBY_EN_SP_OFFSET)
#define IMXRT_ANADIG_PMU_FBB_M7_CONFIGURE             (IMXRT_ANADIG_BASE + IMXRT_ANADIG_PMU_FBB_M7_CONFIGURE_OFFSET)
#define IMXRT_ANADIG_PMU_RBB_LPSR_CONFIGURE           (IMXRT_ANADIG_BASE + IMXRT_ANADIG_PMU_RBB_LPSR_CONFIGURE_OFFSET)
#define IMXRT_ANADIG_PMU_RBB_SOC_CONFIGURE            (IMXRT_ANADIG_BASE + IMXRT_ANADIG_PMU_RBB_SOC_CONFIGURE_OFFSET)
#define IMXRT_ANADIG_PMU_REFTOP_OTP_TRIM_VALUE        (IMXRT_ANADIG_BASE + IMXRT_ANADIG_PMU_REFTOP_OTP_TRIM_VALUE_OFFSET)
#define IMXRT_ANADIG_PMU_LPSR_1P8_LDO_OTP_TRIM_VALUE  (IMXRT_ANADIG_BASE + IMXRT_ANADIG_PMU_LPSR_1P8_LDO_OTP_TRIM_VALUE_OFFSET)

