apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_pmu.h
/* PMU_LDO_PLL_REGISTER (PMU_LDO_PLL) */
#define ANADIG_PMU_PMU_LDO_PLL_LDO_PLL_ENABLE        (1 << 0)   /* Bit 0: LDO_PLL_ENABLE */
#define ANADIG_PMU_PMU_LDO_PLL_LDO_PLL_CONTROL_MODE  (1 << 1)   /* Bit 1: LDO_PLL_CONTROL_MODE */
#define ANADIG_PMU_PMU_LDO_PLL_LDO_PLL_AI_TOGGLE     (1 << 16)  /* Bit 16: ldo_pll_ai_toggle */
#define ANADIG_PMU_PMU_LDO_PLL_LDO_PLL_AI_BUSY       (1 << 30)  /* Bit 30: ldo_pll_busy */

/* PMU_BIAS_CTRL_REGISTER (PMU_BIAS_CTRL) */
#define ANADIG_PMU_PMU_BIAS_CTRL_WB_CFG_1P8_SHIFT  (0)        /* Bits 0-13: wb_cfg_1p8 */
#define ANADIG_PMU_PMU_BIAS_CTRL_WB_CFG_1P8_MASK   (0x1FFF << ANADIG_PMU_PMU_BIAS_CTRL_WB_CFG_1P8_SHIFT)
#define ANADIG_PMU_PMU_BIAS_CTRL_WB_CFG_1P8(n)     (((n) << ANADIG_PMU_PMU_BIAS_CTRL_WB_CFG_1P8_SHIFT) & ANADIG_PMU_PMU_BIAS_CTRL_WB_CFG_1P8_MASK)
#define ANADIG_PMU_PMU_BIAS_CTRL_WB_VDD_SEL_1P8    (1 << 14)  /* Bit 14: wb_vdd_sel_1p8 */

#define ANADIG_PMU_PMU_BIAS_CTRL_WB_CFG_1P8_WELL_SELECT (0x1) /* Bit 0: WELL Select */ 

#define ANADIG_PMU_PMU_BIAS_CTRL_WB_CFG_1P8_VOLTAGE_THRESHOLD_SHIFT (1)
#define ANADIG_PMU_PMU_BIAS_CTRL_WB_CFG_1P8_VOLTAGE_THRESHOLD_MASK  (0x1 << ANADIG_PMU_PMU_BIAS_CTRL_WB_CFG_1P8_VOLTAGE_THRESHOLD_SHIFT)
#define ANADIG_PMU_PMU_BIAS_CTRL_WB_CFG_1P8_VOLTAGE_THRESHOLD(n)    ((n) << ANADIG_PMU_PMU_BIAS_CTRL_WB_CFG_1P8_VOLTAGE_THRESHOLD_SHIFT) & ANADIG_PMU_PMU_BIAS_CTRL_WB_CFG_1P8_VOLTAGE_THRESHOLD_MASK)

#define ANADIG_PMU_PMU_BIAS_CTRL_WB_CFG_1P8_DRIVE_STRENGTH_SHIFT  (2) /* Bits 2-4: Select size of bias area */
#define ANADIG_PMU_PMU_BIAS_CTRL_WB_CFG_1P8_DRIVE_STRENGTH_MASK   (0x7 << ANADIG_PMU_PMU_BIAS_CTRL_WB_CFG_1P8_DRIVE_STRENGTH_SHIFT)
#define ANADIG_PMU_PMU_BIAS_CTRL_WB_CFG_1P8_DRIVE_STRENGTH(n)     ((n) << ANADIG_PMU_PMU_BIAS_CTRL_WB_CFG_1P8_DRIVE_STRENGTH_SHIFT) & ANADIG_PMU_PMU_BIAS_CTRL_WB_CFG_1P8_DRIVE_STRENGTH_MASK)

#define ANADIG_PMU_PMU_BIAS_CTRL_WB_CFG_1P8_OSCILLATOR_FREQ_SHIFT (5) /* Bits 5:8: Oscillator settings */ 
#define ANADIG_PMU_PMU_BIAS_CTRL_WB_CFG_1P8_OSCILLATOR_FREQ_MASK  (0xf << ANADIG_PMU_PMU_BIAS_CTRL_WB_CFG_1P8_OSCILLATOR_FREQ_SHIFT)
#define ANADIG_PMU_PMU_BIAS_CTRL_WB_CFG_1P8_OSCILLATOR_FREQ(n)    ((n) << ANADIG_PMU_PMU_BIAS_CTRL_WB_CFG_1P8_OSCILLATOR_FREQ_SHIFT) & ANADIG_PMU_PMU_BIAS_CTRL_WB_CFG_1P8_OSCILLATOR_FREQ_MASK)

/* PMU_BIAS_CTRL2_REGISTER (PMU_BIAS_CTRL2) */
#define ANADIG_PMU_PMU_BIAS_CTRL2_WB_TST_MD_SHIFT         (1)        /* Bits 1-10: TMOD_wb_tst_md_1p8 */
#define ANADIG_PMU_PMU_BIAS_CTRL2_WB_TST_MD_MASK          (0x1FF << ANADIG_PMU_PMU_BIAS_CTRL2_WB_TST_MD_SHIFT)
#define ANADIG_PMU_PMU_BIAS_CTRL2_WB_TST_MD(n)            (((n) << ANADIG_PMU_PMU_BIAS_CTRL2_WB_TST_MD_SHIFT) & ANADIG_PMU_PMU_BIAS_CTRL2_WB_TST_MD_MASK)
#define ANADIG_PMU_PMU_BIAS_CTRL2_WB_PWR_SW_EN_1P8_SHIFT  (10)       /* Bits 10-12: MODSEL_wb_tst_md_1p8 */
#define ANADIG_PMU_PMU_BIAS_CTRL2_WB_PWR_SW_EN_1P8_MASK   (0x7 << ANADIG_PMU_PMU_BIAS_CTRL2_WB_PWR_SW_EN_1P8_SHIFT)
#define ANADIG_PMU_PMU_BIAS_CTRL2_WB_PWR_SW_EN_1P8(n)     (((n) << ANADIG_PMU_PMU_BIAS_CTRL2_WB_PWR_SW_EN_1P8_SHIFT) & ANADIG_PMU_PMU_BIAS_CTRL2_WB_PWR_SW_EN_1P8_MASK)
#define ANADIG_PMU_PMU_BIAS_CTRL2_WB_ADJ_1P8_SHIFT        (13)       /* Bits 13-20: wb_adj_1p8 */
#define ANADIG_PMU_PMU_BIAS_CTRL2_WB_ADJ_1P8_MASK         (0xFF << ANADIG_PMU_PMU_BIAS_CTRL2_WB_ADJ_1P8_SHIFT)
#define ANADIG_PMU_PMU_BIAS_CTRL2_WB_ADJ_1P8(n)           (((n) << ANADIG_PMU_PMU_BIAS_CTRL2_WB_ADJ_1P8_SHIFT) & ANADIG_PMU_PMU_BIAS_CTRL2_WB_ADJ_1P8_MASK)
#define ANADIG_PMU_PMU_BIAS_CTRL2_FBB_M7_CONTROL_MODE     (1 << 21)  /* Bit 21: FBB_M7_CONTROL_MODE */
#define ANADIG_PMU_PMU_BIAS_CTRL2_RBB_SOC_CONTROL_MODE    (1 << 22)  /* Bit 22: RBB_SOC_CONTROL_MODE */
#define ANADIG_PMU_PMU_BIAS_CTRL2_RBB_LPSR_CONTROL_MODE   (1 << 23)  /* Bit 23: RBB_LPSR_CONTROL_MODE */
#define ANADIG_PMU_PMU_BIAS_CTRL2_WB_EN                   (1 << 24)  /* Bit 24: wb_en */
#define ANADIG_PMU_PMU_BIAS_CTRL2_WB_TST_DIG_OUT          (1 << 25)  /* Bit 25: Digital output */
#define ANADIG_PMU_PMU_BIAS_CTRL2_WB_OK                   (1 << 26)  /* Bit 26: Digital Output pin. */

/* PMU_REF_CTRL_REGISTER (PMU_REF_CTRL) */
#define ANADIG_PMU_PMU_REF_CTRL_REF_AI_TOGGLE          (1 << 0)  /* Bit 0: ref_ai_toggle */
#define ANADIG_PMU_PMU_REF_CTRL_REF_AI_BUSY            (1 << 1)  /* Bit 1: ref_ai_busy */
#define ANADIG_PMU_PMU_REF_CTRL_REF_ENABLE             (1 << 2)  /* Bit 2: REF_ENABLE */
#define ANADIG_PMU_PMU_REF_CTRL_REF_CONTROL_MODE       (1 << 3)  /* Bit 3: REF_CONTROL_MODE */
#define ANADIG_PMU_PMU_REF_CTRL_EN_PLL_VOL_REF_BUFFER  (1 << 4)  /* Bit 4: en_pll_vol_ref_buffer */

/* PMU_POWER_DETECT_CTRL_REGISTER (PMU_POWER_DETECT_CTRL) */
#define ANADIG_PMU_PMU_POWER_DETECT_CTRL_CKGB_LPSR1P0  (1 << 8)  /* Bit 8: ckgb_lpsr1p0 */

/* LDO_PLL_ENABLE_SP_REGISTER (LDO_PLL_ENABLE_SP) */
#define ANADIG_PMU_LDO_PLL_ENABLE_SP_ON_OFF_SETPOINT0   (1 << 0)   /* Bit 0: ON_OFF_SETPOINT0 */
#define ANADIG_PMU_LDO_PLL_ENABLE_SP_ON_OFF_SETPOINT1   (1 << 1)   /* Bit 1: ON_OFF_SETPOINT1 */
#define ANADIG_PMU_LDO_PLL_ENABLE_SP_ON_OFF_SETPOINT2   (1 << 2)   /* Bit 2: ON_OFF_SETPOINT2 */
#define ANADIG_PMU_LDO_PLL_ENABLE_SP_ON_OFF_SETPOINT3   (1 << 3)   /* Bit 3: ON_OFF_SETPOINT3 */
#define ANADIG_PMU_LDO_PLL_ENABLE_SP_ON_OFF_SETPOINT4   (1 << 4)   /* Bit 4: ON_OFF_SETPOINT4 */
#define ANADIG_PMU_LDO_PLL_ENABLE_SP_ON_OFF_SETPOINT5   (1 << 5)   /* Bit 5: ON_OFF_SETPOINT5 */
#define ANADIG_PMU_LDO_PLL_ENABLE_SP_ON_OFF_SETPOINT6   (1 << 6)   /* Bit 6: ON_OFF_SETPOINT6 */
#define ANADIG_PMU_LDO_PLL_ENABLE_SP_ON_OFF_SETPOINT7   (1 << 7)   /* Bit 7: ON_OFF_SETPOINT7 */
#define ANADIG_PMU_LDO_PLL_ENABLE_SP_ON_OFF_SETPOINT8   (1 << 8)   /* Bit 8: ON_OFF_SETPOINT8 */
#define ANADIG_PMU_LDO_PLL_ENABLE_SP_ON_OFF_SETPOINT9   (1 << 9)   /* Bit 9: ON_OFF_SETPOINT9 */
#define ANADIG_PMU_LDO_PLL_ENABLE_SP_ON_OFF_SETPOINT10  (1 << 10)  /* Bit 10: ON_OFF_SETPOINT10 */
#define ANADIG_PMU_LDO_PLL_ENABLE_SP_ON_OFF_SETPOINT11  (1 << 11)  /* Bit 11: ON_OFF_SETPOINT11 */
#define ANADIG_PMU_LDO_PLL_ENABLE_SP_ON_OFF_SETPOINT12  (1 << 12)  /* Bit 12: ON_OFF_SETPOINT12 */
#define ANADIG_PMU_LDO_PLL_ENABLE_SP_ON_OFF_SETPOINT13  (1 << 13)  /* Bit 13: ON_OFF_SETPOINT13 */
#define ANADIG_PMU_LDO_PLL_ENABLE_SP_ON_OFF_SETPOINT14  (1 << 14)  /* Bit 14: ON_OFF_SETPOINT14 */
#define ANADIG_PMU_LDO_PLL_ENABLE_SP_ON_OFF_SETPOINT15  (1 << 15)  /* Bit 15: ON_OFF_SETPOINT15 */

/* LDO_LPSR_ANA_ENABLE_SP_REGISTER (LDO_LPSR_ANA_ENABLE_SP) */
#define ANADIG_PMU_LDO_LPSR_ANA_ENABLE_SP_ON_OFF_SETPOINT0   (1 << 0)   /* Bit 0: ON_OFF_SETPOINT0 */
#define ANADIG_PMU_LDO_LPSR_ANA_ENABLE_SP_ON_OFF_SETPOINT1   (1 << 1)   /* Bit 1: ON_OFF_SETPOINT1 */
#define ANADIG_PMU_LDO_LPSR_ANA_ENABLE_SP_ON_OFF_SETPOINT2   (1 << 2)   /* Bit 2: ON_OFF_SETPOINT2 */
#define ANADIG_PMU_LDO_LPSR_ANA_ENABLE_SP_ON_OFF_SETPOINT3   (1 << 3)   /* Bit 3: ON_OFF_SETPOINT3 */
#define ANADIG_PMU_LDO_LPSR_ANA_ENABLE_SP_ON_OFF_SETPOINT4   (1 << 4)   /* Bit 4: ON_OFF_SETPOINT4 */
#define ANADIG_PMU_LDO_LPSR_ANA_ENABLE_SP_ON_OFF_SETPOINT5   (1 << 5)   /* Bit 5: ON_OFF_SETPOINT5 */
#define ANADIG_PMU_LDO_LPSR_ANA_ENABLE_SP_ON_OFF_SETPOINT6   (1 << 6)   /* Bit 6: ON_OFF_SETPOINT6 */
#define ANADIG_PMU_LDO_LPSR_ANA_ENABLE_SP_ON_OFF_SETPOINT7   (1 << 7)   /* Bit 7: ON_OFF_SETPOINT7 */
#define ANADIG_PMU_LDO_LPSR_ANA_ENABLE_SP_ON_OFF_SETPOINT8   (1 << 8)   /* Bit 8: ON_OFF_SETPOINT8 */
#define ANADIG_PMU_LDO_LPSR_ANA_ENABLE_SP_ON_OFF_SETPOINT9   (1 << 9)   /* Bit 9: ON_OFF_SETPOINT9 */
#define ANADIG_PMU_LDO_LPSR_ANA_ENABLE_SP_ON_OFF_SETPOINT10  (1 << 10)  /* Bit 10: ON_OFF_SETPOINT10 */
#define ANADIG_PMU_LDO_LPSR_ANA_ENABLE_SP_ON_OFF_SETPOINT11  (1 << 11)  /* Bit 11: ON_OFF_SETPOINT11 */
#define ANADIG_PMU_LDO_LPSR_ANA_ENABLE_SP_ON_OFF_SETPOINT12  (1 << 12)  /* Bit 12: ON_OFF_SETPOINT12 */
#define ANADIG_PMU_LDO_LPSR_ANA_ENABLE_SP_ON_OFF_SETPOINT13  (1 << 13)  /* Bit 13: ON_OFF_SETPOINT13 */
#define ANADIG_PMU_LDO_LPSR_ANA_ENABLE_SP_ON_OFF_SETPOINT14  (1 << 14)  /* Bit 14: ON_OFF_SETPOINT14 */
#define ANADIG_PMU_LDO_LPSR_ANA_ENABLE_SP_ON_OFF_SETPOINT15  (1 << 15)  /* Bit 15: ON_OFF_SETPOINT15 */

/* LDO_LPSR_ANA_LP_MODE_SP_REGISTER (LDO_LPSR_ANA_LP_MODE_SP) */
#define ANADIG_PMU_LDO_LPSR_ANA_LP_MODE_SP_LP_MODE_SETPOINT0   (1 << 0)   /* Bit 0: LP_MODE_SETPOINT0 */
#define ANADIG_PMU_LDO_LPSR_ANA_LP_MODE_SP_LP_MODE_SETPOINT1   (1 << 1)   /* Bit 1: LP_MODE_SETPOINT1 */
#define ANADIG_PMU_LDO_LPSR_ANA_LP_MODE_SP_LP_MODE_SETPONIT2   (1 << 2)   /* Bit 2: LP_MODE_SETPOINT2 */
#define ANADIG_PMU_LDO_LPSR_ANA_LP_MODE_SP_LP_MODE_SETPONIT3   (1 << 3)   /* Bit 3: LP_MODE_SETPOINT3 */
#define ANADIG_PMU_LDO_LPSR_ANA_LP_MODE_SP_LP_MODE_SETPONIT4   (1 << 4)   /* Bit 4: LP_MODE_SETPOINT4 */
#define ANADIG_PMU_LDO_LPSR_ANA_LP_MODE_SP_LP_MODE_SETPONIT5   (1 << 5)   /* Bit 5: LP_MODE_SETPOINT5 */
#define ANADIG_PMU_LDO_LPSR_ANA_LP_MODE_SP_LP_MODE_SETPONIT6   (1 << 6)   /* Bit 6: LP_MODE_SETPOINT6 */
#define ANADIG_PMU_LDO_LPSR_ANA_LP_MODE_SP_LP_MODE_SETPONIT7   (1 << 7)   /* Bit 7: LP_MODE_SETPOINT7 */
#define ANADIG_PMU_LDO_LPSR_ANA_LP_MODE_SP_LP_MODE_SETPONIT8   (1 << 8)   /* Bit 8: LP_MODE_SETPOINT8 */
#define ANADIG_PMU_LDO_LPSR_ANA_LP_MODE_SP_LP_MODE_SETPONIT9   (1 << 9)   /* Bit 9: LP_MODE_SETPOINT9 */
#define ANADIG_PMU_LDO_LPSR_ANA_LP_MODE_SP_LP_MODE_SETPONIT10  (1 << 10)  /* Bit 10: LP_MODE_SETPOINT10 */
#define ANADIG_PMU_LDO_LPSR_ANA_LP_MODE_SP_LP_MODE_SETPONIT11  (1 << 11)  /* Bit 11: LP_MODE_SETPOINT11 */
#define ANADIG_PMU_LDO_LPSR_ANA_LP_MODE_SP_LP_MODE_SETPONIT12  (1 << 12)  /* Bit 12: LP_MODE_SETPOINT12 */
#define ANADIG_PMU_LDO_LPSR_ANA_LP_MODE_SP_LP_MODE_SETPONIT13  (1 << 13)  /* Bit 13: LP_MODE_SETPOINT13 */
#define ANADIG_PMU_LDO_LPSR_ANA_LP_MODE_SP_LP_MODE_SETPONIT14  (1 << 14)  /* Bit 14: LP_MODE_SETPOINT14 */
#define ANADIG_PMU_LDO_LPSR_ANA_LP_MODE_SP_LP_MODE_SETPONIT15  (1 << 15)  /* Bit 15: LP_MODE_SETPOINT15 */

