apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_pmu.h
/* LDO_LPSR_DIG_TRG_SP3_REGISTER (LDO_LPSR_DIG_TRG_SP3) */
#define ANADIG_PMU_LDO_LPSR_DIG_TRG_SP3_VOLTAGE_SETPOINT12_SHIFT  (0)   /* Bits 0-8: VOLTAGE_SETPOINT12 */
#define ANADIG_PMU_LDO_LPSR_DIG_TRG_SP3_VOLTAGE_SETPOINT12_MASK   (0xFF << ANADIG_PMU_LDO_LPSR_DIG_TRG_SP3_VOLTAGE_SETPOINT12_SHIFT)
#define ANADIG_PMU_LDO_LPSR_DIG_TRG_SP3_VOLTAGE_SETPOINT12(n)     (((n) << ANADIG_PMU_LDO_LPSR_DIG_TRG_SP3_VOLTAGE_SETPOINT12_SHIFT) & ANADIG_PMU_LDO_LPSR_DIG_TRG_SP3_VOLTAGE_SETPOINT12_MASK)
#define ANADIG_PMU_LDO_LPSR_DIG_TRG_SP3_VOLTAGE_SETPOINT13_SHIFT  (8)   /* Bits 8-16: VOLTAGE_SETPOINT13 */
#define ANADIG_PMU_LDO_LPSR_DIG_TRG_SP3_VOLTAGE_SETPOINT13_MASK   (0xFF << ANADIG_PMU_LDO_LPSR_DIG_TRG_SP3_VOLTAGE_SETPOINT13_SHIFT)
#define ANADIG_PMU_LDO_LPSR_DIG_TRG_SP3_VOLTAGE_SETPOINT13(n)     (((n) << ANADIG_PMU_LDO_LPSR_DIG_TRG_SP3_VOLTAGE_SETPOINT13_SHIFT) & ANADIG_PMU_LDO_LPSR_DIG_TRG_SP3_VOLTAGE_SETPOINT13_MASK)
#define ANADIG_PMU_LDO_LPSR_DIG_TRG_SP3_VOLTAGE_SETPOINT14_SHIFT  (16)  /* Bits 16-24: VOLTAGE_SETPOINT14 */
#define ANADIG_PMU_LDO_LPSR_DIG_TRG_SP3_VOLTAGE_SETPOINT14_MASK   (0xFF << ANADIG_PMU_LDO_LPSR_DIG_TRG_SP3_VOLTAGE_SETPOINT14_SHIFT)
#define ANADIG_PMU_LDO_LPSR_DIG_TRG_SP3_VOLTAGE_SETPOINT14(n)     (((n) << ANADIG_PMU_LDO_LPSR_DIG_TRG_SP3_VOLTAGE_SETPOINT14_SHIFT) & ANADIG_PMU_LDO_LPSR_DIG_TRG_SP3_VOLTAGE_SETPOINT14_MASK)
#define ANADIG_PMU_LDO_LPSR_DIG_TRG_SP3_VOLTAGE_SETPOINT15_SHIFT  (24)  /* Bits 24-32: VOLTAGE_SETPOINT15 */
#define ANADIG_PMU_LDO_LPSR_DIG_TRG_SP3_VOLTAGE_SETPOINT15_MASK   (0xFF << ANADIG_PMU_LDO_LPSR_DIG_TRG_SP3_VOLTAGE_SETPOINT15_SHIFT)
#define ANADIG_PMU_LDO_LPSR_DIG_TRG_SP3_VOLTAGE_SETPOINT15(n)     (((n) << ANADIG_PMU_LDO_LPSR_DIG_TRG_SP3_VOLTAGE_SETPOINT15_SHIFT) & ANADIG_PMU_LDO_LPSR_DIG_TRG_SP3_VOLTAGE_SETPOINT15_MASK)

/* LDO_LPSR_DIG_LP_MODE_SP_REGISTER (LDO_LPSR_DIG_LP_MODE_SP) */
#define ANADIG_PMU_LDO_LPSR_DIG_LP_MODE_SP_LP_MODE_SETPOINT0   (1 << 0)   /* Bit 0: LP_MODE_SETPOINT0 */
#define ANADIG_PMU_LDO_LPSR_DIG_LP_MODE_SP_LP_MODE_SETPOINT1   (1 << 1)   /* Bit 1: LP_MODE_SETPOINT1 */
#define ANADIG_PMU_LDO_LPSR_DIG_LP_MODE_SP_LP_MODE_SETPOINT2   (1 << 2)   /* Bit 2: LP_MODE_SETPOINT2 */
#define ANADIG_PMU_LDO_LPSR_DIG_LP_MODE_SP_LP_MODE_SETPOINT3   (1 << 3)   /* Bit 3: LP_MODE_SETPOINT3 */
#define ANADIG_PMU_LDO_LPSR_DIG_LP_MODE_SP_LP_MODE_SETPOINT4   (1 << 4)   /* Bit 4: LP_MODE_SETPOINT4 */
#define ANADIG_PMU_LDO_LPSR_DIG_LP_MODE_SP_LP_MODE_SETPOINT5   (1 << 5)   /* Bit 5: LP_MODE_SETPOINT5 */
#define ANADIG_PMU_LDO_LPSR_DIG_LP_MODE_SP_LP_MODE_SETPOINT6   (1 << 6)   /* Bit 6: LP_MODE_SETPOINT6 */
#define ANADIG_PMU_LDO_LPSR_DIG_LP_MODE_SP_LP_MODE_SETPOINT7   (1 << 7)   /* Bit 7: LP_MODE_SETPOINT7 */
#define ANADIG_PMU_LDO_LPSR_DIG_LP_MODE_SP_LP_MODE_SETPOINT8   (1 << 8)   /* Bit 8: LP_MODE_SETPOINT8 */
#define ANADIG_PMU_LDO_LPSR_DIG_LP_MODE_SP_LP_MODE_SETPOINT9   (1 << 9)   /* Bit 9: LP_MODE_SETPOINT9 */
#define ANADIG_PMU_LDO_LPSR_DIG_LP_MODE_SP_LP_MODE_SETPOINT10  (1 << 10)  /* Bit 10: LP_MODE_SETPOINT10 */
#define ANADIG_PMU_LDO_LPSR_DIG_LP_MODE_SP_LP_MODE_SETPOINT11  (1 << 11)  /* Bit 11: LP_MODE_SETPOINT11 */
#define ANADIG_PMU_LDO_LPSR_DIG_LP_MODE_SP_LP_MODE_SETPOINT12  (1 << 12)  /* Bit 12: LP_MODE_SETPOINT12 */
#define ANADIG_PMU_LDO_LPSR_DIG_LP_MODE_SP_LP_MODE_SETPOINT13  (1 << 13)  /* Bit 13: LP_MODE_SETPOINT13 */
#define ANADIG_PMU_LDO_LPSR_DIG_LP_MODE_SP_LP_MODE_SETPOINT14  (1 << 14)  /* Bit 14: LP_MODE_SETPOINT14 */
#define ANADIG_PMU_LDO_LPSR_DIG_LP_MODE_SP_LP_MODE_SETPOINT15  (1 << 15)  /* Bit 15: LP_MODE_SETPOINT15 */

/* LDO_LPSR_DIG_TRACKING_EN_SP_REGISTER (LDO_LPSR_DIG_TRACKING_EN_SP) */
#define ANADIG_PMU_LDO_LPSR_DIG_TRACKING_EN_SP_TRACKING_EN_SETPOINT0   (1 << 0)   /* Bit 0: TRACKING_EN_SETPOINT0 */
#define ANADIG_PMU_LDO_LPSR_DIG_TRACKING_EN_SP_TRACKING_EN_SETPOINT1   (1 << 1)   /* Bit 1: TRACKING_EN_SETPOINT1 */
#define ANADIG_PMU_LDO_LPSR_DIG_TRACKING_EN_SP_TRACKING_EN_SETPOINT2   (1 << 2)   /* Bit 2: TRACKING_EN_SETPOINT2 */
#define ANADIG_PMU_LDO_LPSR_DIG_TRACKING_EN_SP_TRACKING_EN_SETPOINT3   (1 << 3)   /* Bit 3: TRACKING_EN_SETPOINT3 */
#define ANADIG_PMU_LDO_LPSR_DIG_TRACKING_EN_SP_TRACKING_EN_SETPOINT4   (1 << 4)   /* Bit 4: TRACKING_EN_SETPOINT4 */
#define ANADIG_PMU_LDO_LPSR_DIG_TRACKING_EN_SP_TRACKING_EN_SETPOINT5   (1 << 5)   /* Bit 5: TRACKING_EN_SETPOINT5 */
#define ANADIG_PMU_LDO_LPSR_DIG_TRACKING_EN_SP_TRACKING_EN_SETPOINT6   (1 << 6)   /* Bit 6: TRACKING_EN_SETPOINT6 */
#define ANADIG_PMU_LDO_LPSR_DIG_TRACKING_EN_SP_TRACKING_EN_SETPOINT7   (1 << 7)   /* Bit 7: TRACKING_EN_SETPOINT7 */
#define ANADIG_PMU_LDO_LPSR_DIG_TRACKING_EN_SP_TRACKING_EN_SETPOINT8   (1 << 8)   /* Bit 8: TRACKING_EN_SETPOINT8 */
#define ANADIG_PMU_LDO_LPSR_DIG_TRACKING_EN_SP_TRACKING_EN_SETPOINT9   (1 << 9)   /* Bit 9: TRACKING_EN_SETPOINT9 */
#define ANADIG_PMU_LDO_LPSR_DIG_TRACKING_EN_SP_TRACKING_EN_SETPOINT10  (1 << 10)  /* Bit 10: TRACKING_EN_SETPOINT10 */
#define ANADIG_PMU_LDO_LPSR_DIG_TRACKING_EN_SP_TRACKING_EN_SETPOINT11  (1 << 11)  /* Bit 11: TRACKING_EN_SETPOINT11 */
#define ANADIG_PMU_LDO_LPSR_DIG_TRACKING_EN_SP_TRACKING_EN_SETPOINT12  (1 << 12)  /* Bit 12: TRACKING_EN_SETPOINT12 */
#define ANADIG_PMU_LDO_LPSR_DIG_TRACKING_EN_SP_TRACKING_EN_SETPOINT13  (1 << 13)  /* Bit 13: TRACKING_EN_SETPOINT13 */
#define ANADIG_PMU_LDO_LPSR_DIG_TRACKING_EN_SP_TRACKING_EN_SETPOINT14  (1 << 14)  /* Bit 14: TRACKING_EN_SETPOINT14 */
#define ANADIG_PMU_LDO_LPSR_DIG_TRACKING_EN_SP_TRACKING_EN_SETPOINT15  (1 << 15)  /* Bit 15: TRACKING_EN_SETPOINT15 */

/* LDO_LPSR_DIG_BYPASS_EN_SP_REGISTER (LDO_LPSR_DIG_BYPASS_EN_SP) */
#define ANADIG_PMU_LDO_LPSR_DIG_BYPASS_EN_SP_BYPASS_EN_SETPOINT0   (1 << 0)   /* Bit 0: BYPASS_EN_SETPOINT0 */
#define ANADIG_PMU_LDO_LPSR_DIG_BYPASS_EN_SP_BYPASS_EN_SETPOINT1   (1 << 1)   /* Bit 1: BYPASS_EN_SETPOINT1 */
#define ANADIG_PMU_LDO_LPSR_DIG_BYPASS_EN_SP_BYPASS_EN_SETPOINT2   (1 << 2)   /* Bit 2: BYPASS_EN_SETPOINT2 */
#define ANADIG_PMU_LDO_LPSR_DIG_BYPASS_EN_SP_BYPASS_EN_SETPOINT3   (1 << 3)   /* Bit 3: BYPASS_EN_SETPOINT3 */
#define ANADIG_PMU_LDO_LPSR_DIG_BYPASS_EN_SP_BYPASS_EN_SETPOINT4   (1 << 4)   /* Bit 4: BYPASS_EN_SETPOINT4 */
#define ANADIG_PMU_LDO_LPSR_DIG_BYPASS_EN_SP_BYPASS_EN_SETPOINT5   (1 << 5)   /* Bit 5: BYPASS_EN_SETPOINT5 */
#define ANADIG_PMU_LDO_LPSR_DIG_BYPASS_EN_SP_BYPASS_EN_SETPOINT6   (1 << 6)   /* Bit 6: BYPASS_EN_SETPOINT6 */
#define ANADIG_PMU_LDO_LPSR_DIG_BYPASS_EN_SP_BYPASS_EN_SETPOINT7   (1 << 7)   /* Bit 7: BYPASS_EN_SETPOINT7 */
#define ANADIG_PMU_LDO_LPSR_DIG_BYPASS_EN_SP_BYPASS_EN_SETPOINT8   (1 << 8)   /* Bit 8: BYPASS_EN_SETPOINT8 */
#define ANADIG_PMU_LDO_LPSR_DIG_BYPASS_EN_SP_BYPASS_EN_SETPOINT9   (1 << 9)   /* Bit 9: BYPASS_EN_SETPOINT9 */
#define ANADIG_PMU_LDO_LPSR_DIG_BYPASS_EN_SP_BYPASS_EN_SETPOINT10  (1 << 10)  /* Bit 10: BYPASS_EN_SETPOINT10 */
#define ANADIG_PMU_LDO_LPSR_DIG_BYPASS_EN_SP_BYPASS_EN_SETPOINT11  (1 << 11)  /* Bit 11: BYPASS_EN_SETPOINT11 */
#define ANADIG_PMU_LDO_LPSR_DIG_BYPASS_EN_SP_BYPASS_EN_SETPOINT12  (1 << 12)  /* Bit 12: BYPASS_EN_SETPOINT12 */
#define ANADIG_PMU_LDO_LPSR_DIG_BYPASS_EN_SP_BYPASS_EN_SETPOINT13  (1 << 13)  /* Bit 13: BYPASS_EN_SETPOINT13 */
#define ANADIG_PMU_LDO_LPSR_DIG_BYPASS_EN_SP_BYPASS_EN_SETPOINT14  (1 << 14)  /* Bit 14: BYPASS_EN_SETPOINT14 */
#define ANADIG_PMU_LDO_LPSR_DIG_BYPASS_EN_SP_BYPASS_EN_SETPOINT15  (1 << 15)  /* Bit 15: BYPASS_EN_SETPOINT15 */

/* LDO_LPSR_DIG_STBY_EN_SP_REGISTER (LDO_LPSR_DIG_STBY_EN_SP) */
#define ANADIG_PMU_LDO_LPSR_DIG_STBY_EN_SP_STBY_EN_SETPOINT0   (1 << 0)   /* Bit 0: STBY_EN_SETPOINT0 */
#define ANADIG_PMU_LDO_LPSR_DIG_STBY_EN_SP_STBY_EN_SETPOINT1   (1 << 1)   /* Bit 1: STBY_EN_SETPOINT1 */
#define ANADIG_PMU_LDO_LPSR_DIG_STBY_EN_SP_STBY_EN_SETPOINT2   (1 << 2)   /* Bit 2: STBY_EN_SETPOINT2 */
#define ANADIG_PMU_LDO_LPSR_DIG_STBY_EN_SP_STBY_EN_SETPOINT3   (1 << 3)   /* Bit 3: STBY_EN_SETPOINT3 */
#define ANADIG_PMU_LDO_LPSR_DIG_STBY_EN_SP_STBY_EN_SETPOINT4   (1 << 4)   /* Bit 4: STBY_EN_SETPOINT4 */
#define ANADIG_PMU_LDO_LPSR_DIG_STBY_EN_SP_STBY_EN_SETPOINT5   (1 << 5)   /* Bit 5: STBY_EN_SETPOINT5 */
#define ANADIG_PMU_LDO_LPSR_DIG_STBY_EN_SP_STBY_EN_SETPOINT6   (1 << 6)   /* Bit 6: STBY_EN_SETPOINT6 */
#define ANADIG_PMU_LDO_LPSR_DIG_STBY_EN_SP_STBY_EN_SETPOINT7   (1 << 7)   /* Bit 7: STBY_EN_SETPOINT7 */
#define ANADIG_PMU_LDO_LPSR_DIG_STBY_EN_SP_STBY_EN_SETPOINT8   (1 << 8)   /* Bit 8: STBY_EN_SETPOINT8 */
#define ANADIG_PMU_LDO_LPSR_DIG_STBY_EN_SP_STBY_EN_SETPOINT9   (1 << 9)   /* Bit 9: STBY_EN_SETPOINT9 */
#define ANADIG_PMU_LDO_LPSR_DIG_STBY_EN_SP_STBY_EN_SETPOINT10  (1 << 10)  /* Bit 10: STBY_EN_SETPOINT10 */
#define ANADIG_PMU_LDO_LPSR_DIG_STBY_EN_SP_STBY_EN_SETPOINT11  (1 << 11)  /* Bit 11: STBY_EN_SETPOINT11 */
#define ANADIG_PMU_LDO_LPSR_DIG_STBY_EN_SP_STBY_EN_SETPOINT12  (1 << 12)  /* Bit 12: STBY_EN_SETPOINT12 */
#define ANADIG_PMU_LDO_LPSR_DIG_STBY_EN_SP_STBY_EN_SETPOINT13  (1 << 13)  /* Bit 13: STBY_EN_SETPOINT13 */
#define ANADIG_PMU_LDO_LPSR_DIG_STBY_EN_SP_STBY_EN_SETPOINT14  (1 << 14)  /* Bit 14: STBY_EN_SETPOINT14 */
#define ANADIG_PMU_LDO_LPSR_DIG_STBY_EN_SP_STBY_EN_SETPOINT15  (1 << 15)  /* Bit 15: STBY_EN_SETPOINT15 */

/* BANDGAP_ENABLE_SP_REGISTER (BANDGAP_ENABLE_SP) */
#define ANADIG_PMU_BANDGAP_ENABLE_SP_ON_OFF_SETPOINT0   (1 << 0)   /* Bit 0: ON_OFF_SETPOINT0 */
#define ANADIG_PMU_BANDGAP_ENABLE_SP_ON_OFF_SETPOINT1   (1 << 1)   /* Bit 1: ON_OFF_SETPOINT1 */
#define ANADIG_PMU_BANDGAP_ENABLE_SP_ON_OFF_SETPOINT2   (1 << 2)   /* Bit 2: ON_OFF_SETPOINT2 */
#define ANADIG_PMU_BANDGAP_ENABLE_SP_ON_OFF_SETPOINT3   (1 << 3)   /* Bit 3: ON_OFF_SETPOINT3 */
#define ANADIG_PMU_BANDGAP_ENABLE_SP_ON_OFF_SETPOINT4   (1 << 4)   /* Bit 4: ON_OFF_SETPOINT4 */
#define ANADIG_PMU_BANDGAP_ENABLE_SP_ON_OFF_SETPOINT5   (1 << 5)   /* Bit 5: ON_OFF_SETPOINT5 */
#define ANADIG_PMU_BANDGAP_ENABLE_SP_ON_OFF_SETPOINT6   (1 << 6)   /* Bit 6: ON_OFF_SETPOINT5 */
#define ANADIG_PMU_BANDGAP_ENABLE_SP_ON_OFF_SETPOINT7   (1 << 7)   /* Bit 7: ON_OFF_SETPOINT7 */
#define ANADIG_PMU_BANDGAP_ENABLE_SP_ON_OFF_SETPOINT8   (1 << 8)   /* Bit 8: ON_OFF_SETPOINT8 */
#define ANADIG_PMU_BANDGAP_ENABLE_SP_ON_OFF_SETPOINT9   (1 << 9)   /* Bit 9: ON_OFF_SETPOINT9 */
#define ANADIG_PMU_BANDGAP_ENABLE_SP_ON_OFF_SETPOINT10  (1 << 10)  /* Bit 10: ON_OFF_SETPOINT10 */
#define ANADIG_PMU_BANDGAP_ENABLE_SP_ON_OFF_SETPOINT11  (1 << 11)  /* Bit 11: ON_OFF_SETPOINT11 */
#define ANADIG_PMU_BANDGAP_ENABLE_SP_ON_OFF_SETPOINT12  (1 << 12)  /* Bit 12: ON_OFF_SETPOINT12 */
#define ANADIG_PMU_BANDGAP_ENABLE_SP_ON_OFF_SETPOINT13  (1 << 13)  /* Bit 13: ON_OFF_SETPOINT13 */
#define ANADIG_PMU_BANDGAP_ENABLE_SP_ON_OFF_SETPOINT14  (1 << 14)  /* Bit 14: ON_OFF_SETPOINT14 */
#define ANADIG_PMU_BANDGAP_ENABLE_SP_ON_OFF_SETPOINT15  (1 << 15)  /* Bit 15: ON_OFF_SETPOINT15 */

/* FBB_M7_ENABLE_SP_REGISTER (FBB_M7_ENABLE_SP) */
#define ANADIG_PMU_FBB_M7_ENABLE_SP_ON_OFF_SETPOINT0   (1 << 0)   /* Bit 0: ON_OFF_SETPOINT0 */
#define ANADIG_PMU_FBB_M7_ENABLE_SP_ON_OFF_SETPOINT1   (1 << 1)   /* Bit 1: ON_OFF_SETPOINT1 */
#define ANADIG_PMU_FBB_M7_ENABLE_SP_ON_OFF_SETPOINT2   (1 << 2)   /* Bit 2: ON_OFF_SETPOINT2 */
#define ANADIG_PMU_FBB_M7_ENABLE_SP_ON_OFF_SETPOINT3   (1 << 3)   /* Bit 3: ON_OFF_SETPOINT3 */
#define ANADIG_PMU_FBB_M7_ENABLE_SP_ON_OFF_SETPOINT4   (1 << 4)   /* Bit 4: ON_OFF_SETPOINT4 */
#define ANADIG_PMU_FBB_M7_ENABLE_SP_ON_OFF_SETPOINT5   (1 << 5)   /* Bit 5: ON_OFF_SETPOINT5 */
#define ANADIG_PMU_FBB_M7_ENABLE_SP_ON_OFF_SETPOINT6   (1 << 6)   /* Bit 6: ON_OFF_SETPOINT6 */
#define ANADIG_PMU_FBB_M7_ENABLE_SP_ON_OFF_SETPOINT7   (1 << 7)   /* Bit 7: ON_OFF_SETPOINT7 */
#define ANADIG_PMU_FBB_M7_ENABLE_SP_ON_OFF_SETPOINT8   (1 << 8)   /* Bit 8: ON_OFF_SETPOINT8 */
#define ANADIG_PMU_FBB_M7_ENABLE_SP_ON_OFF_SETPOINT9   (1 << 9)   /* Bit 9: ON_OFF_SETPOINT9 */
#define ANADIG_PMU_FBB_M7_ENABLE_SP_ON_OFF_SETPOINT10  (1 << 10)  /* Bit 10: ON_OFF_SETPOINT10 */
#define ANADIG_PMU_FBB_M7_ENABLE_SP_ON_OFF_SETPOINT11  (1 << 11)  /* Bit 11: ON_OFF_SETPOINT11 */
#define ANADIG_PMU_FBB_M7_ENABLE_SP_ON_OFF_SETPOINT12  (1 << 12)  /* Bit 12: ON_OFF_SETPOINT12 */
#define ANADIG_PMU_FBB_M7_ENABLE_SP_ON_OFF_SETPOINT13  (1 << 13)  /* Bit 13: ON_OFF_SETPOINT13 */
#define ANADIG_PMU_FBB_M7_ENABLE_SP_ON_OFF_SETPOINT14  (1 << 14)  /* Bit 14: ON_OFF_SETPOINT14 */
#define ANADIG_PMU_FBB_M7_ENABLE_SP_ON_OFF_SETPOINT15  (1 << 15)  /* Bit 15: ON_OFF_SETPOINT15 */

/* RBB_SOC_ENABLE_SP_REGISTER (RBB_SOC_ENABLE_SP) */
#define ANADIG_PMU_RBB_SOC_ENABLE_SP_ON_OFF_SETPOINT0   (1 << 0)   /* Bit 0: ON_OFF_SETPOINT0 */
#define ANADIG_PMU_RBB_SOC_ENABLE_SP_ON_OFF_SETPOINT1   (1 << 1)   /* Bit 1: ON_OFF_SETPOINT1 */
#define ANADIG_PMU_RBB_SOC_ENABLE_SP_ON_OFF_SETPOINT2   (1 << 2)   /* Bit 2: ON_OFF_SETPOINT2 */
#define ANADIG_PMU_RBB_SOC_ENABLE_SP_ON_OFF_SETPOINT3   (1 << 3)   /* Bit 3: ON_OFF_SETPOINT3 */
#define ANADIG_PMU_RBB_SOC_ENABLE_SP_ON_OFF_SETPOINT4   (1 << 4)   /* Bit 4: ON_OFF_SETPOINT4 */
#define ANADIG_PMU_RBB_SOC_ENABLE_SP_ON_OFF_SETPOINT5   (1 << 5)   /* Bit 5: ON_OFF_SETPOINT5 */
#define ANADIG_PMU_RBB_SOC_ENABLE_SP_ON_OFF_SETPOINT6   (1 << 6)   /* Bit 6: ON_OFF_SETPOINT6 */
#define ANADIG_PMU_RBB_SOC_ENABLE_SP_ON_OFF_SETPOINT7   (1 << 7)   /* Bit 7: ON_OFF_SETPOINT7 */
#define ANADIG_PMU_RBB_SOC_ENABLE_SP_ON_OFF_SETPOINT8   (1 << 8)   /* Bit 8: ON_OFF_SETPOINT8 */
#define ANADIG_PMU_RBB_SOC_ENABLE_SP_ON_OFF_SETPOINT9   (1 << 9)   /* Bit 9: ON_OFF_SETPOINT9 */
#define ANADIG_PMU_RBB_SOC_ENABLE_SP_ON_OFF_SETPOINT10  (1 << 10)  /* Bit 10: ON_OFF_SETPOINT10 */
#define ANADIG_PMU_RBB_SOC_ENABLE_SP_ON_OFF_SETPOINT11  (1 << 11)  /* Bit 11: ON_OFF_SETPOINT11 */
#define ANADIG_PMU_RBB_SOC_ENABLE_SP_ON_OFF_SETPOINT12  (1 << 12)  /* Bit 12: ON_OFF_SETPOINT12 */
#define ANADIG_PMU_RBB_SOC_ENABLE_SP_ON_OFF_SETPOINT13  (1 << 13)  /* Bit 13: ON_OFF_SETPOINT13 */
#define ANADIG_PMU_RBB_SOC_ENABLE_SP_ON_OFF_SETPOINT14  (1 << 14)  /* Bit 14: ON_OFF_SETPOINT14 */
#define ANADIG_PMU_RBB_SOC_ENABLE_SP_ON_OFF_SETPOINT15  (1 << 15)  /* Bit 15: ON_OFF_SETPOINT15 */

/* RBB_LPSR_ENABLE_SP_REGISTER (RBB_LPSR_ENABLE_SP) */
#define ANADIG_PMU_RBB_LPSR_ENABLE_SP_ON_OFF_SETPOINT0   (1 << 0)   /* Bit 0: ON_OFF_SETPOINT0 */
#define ANADIG_PMU_RBB_LPSR_ENABLE_SP_ON_OFF_SETPOINT1   (1 << 1)   /* Bit 1: ON_OFF_SETPOINT1 */
#define ANADIG_PMU_RBB_LPSR_ENABLE_SP_ON_OFF_SETPOINT2   (1 << 2)   /* Bit 2: ON_OFF_SETPOINT2 */
#define ANADIG_PMU_RBB_LPSR_ENABLE_SP_ON_OFF_SETPOINT3   (1 << 3)   /* Bit 3: ON_OFF_SETPOINT3 */
#define ANADIG_PMU_RBB_LPSR_ENABLE_SP_ON_OFF_SETPOINT4   (1 << 4)   /* Bit 4: ON_OFF_SETPOINT4 */
#define ANADIG_PMU_RBB_LPSR_ENABLE_SP_ON_OFF_SETPOINT5   (1 << 5)   /* Bit 5: ON_OFF_SETPOINT5 */
#define ANADIG_PMU_RBB_LPSR_ENABLE_SP_ON_OFF_SETPOINT6   (1 << 6)   /* Bit 6: ON_OFF_SETPOINT6 */
#define ANADIG_PMU_RBB_LPSR_ENABLE_SP_ON_OFF_SETPOINT7   (1 << 7)   /* Bit 7: ON_OFF_SETPOINT7 */
#define ANADIG_PMU_RBB_LPSR_ENABLE_SP_ON_OFF_SETPOINT8   (1 << 8)   /* Bit 8: ON_OFF_SETPOINT8 */
#define ANADIG_PMU_RBB_LPSR_ENABLE_SP_ON_OFF_SETPOINT9   (1 << 9)   /* Bit 9: ON_OFF_SETPOINT9 */
#define ANADIG_PMU_RBB_LPSR_ENABLE_SP_ON_OFF_SETPOINT10  (1 << 10)  /* Bit 10: ON_OFF_SETPOINT10 */
#define ANADIG_PMU_RBB_LPSR_ENABLE_SP_ON_OFF_SETPOINT11  (1 << 11)  /* Bit 11: ON_OFF_SETPOINT11 */
#define ANADIG_PMU_RBB_LPSR_ENABLE_SP_ON_OFF_SETPOINT12  (1 << 12)  /* Bit 12: ON_OFF_SETPOINT12 */
#define ANADIG_PMU_RBB_LPSR_ENABLE_SP_ON_OFF_SETPOINT13  (1 << 13)  /* Bit 13: ON_OFF_SETPOINT13 */
#define ANADIG_PMU_RBB_LPSR_ENABLE_SP_ON_OFF_SETPOINT14  (1 << 14)  /* Bit 14: ON_OFF_SETPOINT14 */
#define ANADIG_PMU_RBB_LPSR_ENABLE_SP_ON_OFF_SETPOINT15  (1 << 15)  /* Bit 15: ON_OFF_SETPOINT15 */

/* BANDGAP_STBY_EN_SP_REGISTER (BANDGAP_STBY_EN_SP) */
#define ANADIG_PMU_BANDGAP_STBY_EN_SP_STBY_EN_SETPOINT0   (1 << 0)   /* Bit 0: STBY_EN_SETPOINT */
#define ANADIG_PMU_BANDGAP_STBY_EN_SP_STBY_EN_SETPOINT1   (1 << 1)   /* Bit 1: STBY_EN_SETPOINT */
#define ANADIG_PMU_BANDGAP_STBY_EN_SP_STBY_EN_SETPOINT2   (1 << 2)   /* Bit 2: STBY_EN_SETPOINT */
#define ANADIG_PMU_BANDGAP_STBY_EN_SP_STBY_EN_SETPOINT3   (1 << 3)   /* Bit 3: STBY_EN_SETPOINT */
#define ANADIG_PMU_BANDGAP_STBY_EN_SP_STBY_EN_SETPOINT4   (1 << 4)   /* Bit 4: STBY_EN_SETPOINT */
#define ANADIG_PMU_BANDGAP_STBY_EN_SP_STBY_EN_SETPOINT5   (1 << 5)   /* Bit 5: STBY_EN_SETPOINT */
#define ANADIG_PMU_BANDGAP_STBY_EN_SP_STBY_EN_SETPOINT6   (1 << 6)   /* Bit 6: STBY_EN_SETPOINT */
#define ANADIG_PMU_BANDGAP_STBY_EN_SP_STBY_EN_SETPOINT7   (1 << 7)   /* Bit 7: STBY_EN_SETPOINT */
#define ANADIG_PMU_BANDGAP_STBY_EN_SP_STBY_EN_SETPOINT8   (1 << 8)   /* Bit 8: STBY_EN_SETPOINT */
#define ANADIG_PMU_BANDGAP_STBY_EN_SP_STBY_EN_SETPOINT9   (1 << 9)   /* Bit 9: STBY_EN_SETPOINT */
#define ANADIG_PMU_BANDGAP_STBY_EN_SP_STBY_EN_SETPOINT10  (1 << 10)  /* Bit 10: STBY_EN_SETPOINT */
#define ANADIG_PMU_BANDGAP_STBY_EN_SP_STBY_EN_SETPOINT11  (1 << 11)  /* Bit 11: STBY_EN_SETPOINT */
#define ANADIG_PMU_BANDGAP_STBY_EN_SP_STBY_EN_SETPOINT12  (1 << 12)  /* Bit 12: STBY_EN_SETPOINT */
#define ANADIG_PMU_BANDGAP_STBY_EN_SP_STBY_EN_SETPOINT13  (1 << 13)  /* Bit 13: STBY_EN_SETPOINT */
#define ANADIG_PMU_BANDGAP_STBY_EN_SP_STBY_EN_SETPOINT14  (1 << 14)  /* Bit 14: STBY_EN_SETPOINT */
#define ANADIG_PMU_BANDGAP_STBY_EN_SP_STBY_EN_SETPOINT15  (1 << 15)  /* Bit 15: STBY_EN_SETPOINT */

