apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_pmu.h
/* PLL_LDO_STBY_EN_SP_REGISTER (PLL_LDO_STBY_EN_SP) */
#define ANADIG_PMU_PLL_LDO_STBY_EN_SP_STBY_EN_SETPOINT0   (1 << 0)   /* Bit 0: Standby mode */
#define ANADIG_PMU_PLL_LDO_STBY_EN_SP_STBY_EN_SETPOINT1   (1 << 1)   /* Bit 1: Standby mode */
#define ANADIG_PMU_PLL_LDO_STBY_EN_SP_STBY_EN_SETPOINT2   (1 << 2)   /* Bit 2: Standby mode */
#define ANADIG_PMU_PLL_LDO_STBY_EN_SP_STBY_EN_SETPOINT3   (1 << 3)   /* Bit 3: Standby mode */
#define ANADIG_PMU_PLL_LDO_STBY_EN_SP_STBY_EN_SETPOINT4   (1 << 4)   /* Bit 4: Standby mode */
#define ANADIG_PMU_PLL_LDO_STBY_EN_SP_STBY_EN_SETPOINT5   (1 << 5)   /* Bit 5: Standby mode */
#define ANADIG_PMU_PLL_LDO_STBY_EN_SP_STBY_EN_SETPOINT6   (1 << 6)   /* Bit 6: Standby mode */
#define ANADIG_PMU_PLL_LDO_STBY_EN_SP_STBY_EN_SETPOINT7   (1 << 7)   /* Bit 7: Standby mode */
#define ANADIG_PMU_PLL_LDO_STBY_EN_SP_STBY_EN_SETPOINT8   (1 << 8)   /* Bit 8: Standby mode */
#define ANADIG_PMU_PLL_LDO_STBY_EN_SP_STBY_EN_SETPOINT9   (1 << 9)   /* Bit 9: Standby mode */
#define ANADIG_PMU_PLL_LDO_STBY_EN_SP_STBY_EN_SETPOINT10  (1 << 10)  /* Bit 10: Standby mode */
#define ANADIG_PMU_PLL_LDO_STBY_EN_SP_STBY_EN_SETPOINT11  (1 << 11)  /* Bit 11: Standby mode */
#define ANADIG_PMU_PLL_LDO_STBY_EN_SP_STBY_EN_SETPOINT12  (1 << 12)  /* Bit 12: Standby mode */
#define ANADIG_PMU_PLL_LDO_STBY_EN_SP_STBY_EN_SETPOINT13  (1 << 13)  /* Bit 13: Standby mode */
#define ANADIG_PMU_PLL_LDO_STBY_EN_SP_STBY_EN_SETPOINT14  (1 << 14)  /* Bit 14: Standby mode */
#define ANADIG_PMU_PLL_LDO_STBY_EN_SP_STBY_EN_SETPOINT15  (1 << 15)  /* Bit 15: Standby mode */

/* FBB_M7_STBY_EN_SP_REGISTER (FBB_M7_STBY_EN_SP) */
#define ANADIG_PMU_FBB_M7_STBY_EN_SP_STBY_EN_SETPOINT0   (1 << 0)   /* Bit 0: Standby mode */
#define ANADIG_PMU_FBB_M7_STBY_EN_SP_STBY_EN_SETPOINT1   (1 << 1)   /* Bit 1: Standby mode */
#define ANADIG_PMU_FBB_M7_STBY_EN_SP_STBY_EN_SETPOINT2   (1 << 2)   /* Bit 2: Standby mode */
#define ANADIG_PMU_FBB_M7_STBY_EN_SP_STBY_EN_SETPOINT3   (1 << 3)   /* Bit 3: Standby mode */
#define ANADIG_PMU_FBB_M7_STBY_EN_SP_STBY_EN_SETPOINT4   (1 << 4)   /* Bit 4: Standby mode */
#define ANADIG_PMU_FBB_M7_STBY_EN_SP_STBY_EN_SETPOINT5   (1 << 5)   /* Bit 5: Standby mode */
#define ANADIG_PMU_FBB_M7_STBY_EN_SP_STBY_EN_SETPOINT6   (1 << 6)   /* Bit 6: Standby mode */
#define ANADIG_PMU_FBB_M7_STBY_EN_SP_STBY_EN_SETPOINT7   (1 << 7)   /* Bit 7: Standby mode */
#define ANADIG_PMU_FBB_M7_STBY_EN_SP_STBY_EN_SETPOINT8   (1 << 8)   /* Bit 8: Standby mode */
#define ANADIG_PMU_FBB_M7_STBY_EN_SP_STBY_EN_SETPOINT9   (1 << 9)   /* Bit 9: Standby mode */
#define ANADIG_PMU_FBB_M7_STBY_EN_SP_STBY_EN_SETPOINT10  (1 << 10)  /* Bit 10: Standby mode */
#define ANADIG_PMU_FBB_M7_STBY_EN_SP_STBY_EN_SETPOINT11  (1 << 11)  /* Bit 11: Standby mode */
#define ANADIG_PMU_FBB_M7_STBY_EN_SP_STBY_EN_SETPOINT12  (1 << 12)  /* Bit 12: Standby mode */
#define ANADIG_PMU_FBB_M7_STBY_EN_SP_STBY_EN_SETPOINT13  (1 << 13)  /* Bit 13: Standby mode */
#define ANADIG_PMU_FBB_M7_STBY_EN_SP_STBY_EN_SETPOINT14  (1 << 14)  /* Bit 14: Standby mode */
#define ANADIG_PMU_FBB_M7_STBY_EN_SP_STBY_EN_SETPOINT15  (1 << 15)  /* Bit 15: Standby mode */

/* RBB_SOC_STBY_EN_SP_REGISTER (RBB_SOC_STBY_EN_SP) */
#define ANADIG_PMU_RBB_SOC_STBY_EN_SP_STBY_EN_SETPOINT0   (1 << 0)   /* Bit 0: Standby mode */
#define ANADIG_PMU_RBB_SOC_STBY_EN_SP_STBY_EN_SETPOINT1   (1 << 1)   /* Bit 1: Standby mode */
#define ANADIG_PMU_RBB_SOC_STBY_EN_SP_STBY_EN_SETPOINT2   (1 << 2)   /* Bit 2: Standby mode */
#define ANADIG_PMU_RBB_SOC_STBY_EN_SP_STBY_EN_SETPOINT3   (1 << 3)   /* Bit 3: Standby mode */
#define ANADIG_PMU_RBB_SOC_STBY_EN_SP_STBY_EN_SETPOINT4   (1 << 4)   /* Bit 4: Standby mode */
#define ANADIG_PMU_RBB_SOC_STBY_EN_SP_STBY_EN_SETPOINT5   (1 << 5)   /* Bit 5: Standby mode */
#define ANADIG_PMU_RBB_SOC_STBY_EN_SP_STBY_EN_SETPOINT6   (1 << 6)   /* Bit 6: Standby mode */
#define ANADIG_PMU_RBB_SOC_STBY_EN_SP_STBY_EN_SETPOINT7   (1 << 7)   /* Bit 7: Standby mode */
#define ANADIG_PMU_RBB_SOC_STBY_EN_SP_STBY_EN_SETPOINT8   (1 << 8)   /* Bit 8: Standby mode */
#define ANADIG_PMU_RBB_SOC_STBY_EN_SP_STBY_EN_SETPOINT9   (1 << 9)   /* Bit 9: Standby mode */
#define ANADIG_PMU_RBB_SOC_STBY_EN_SP_STBY_EN_SETPOINT10  (1 << 10)  /* Bit 10: Standby mode */
#define ANADIG_PMU_RBB_SOC_STBY_EN_SP_STBY_EN_SETPOINT11  (1 << 11)  /* Bit 11: Standby mode */
#define ANADIG_PMU_RBB_SOC_STBY_EN_SP_STBY_EN_SETPOINT12  (1 << 12)  /* Bit 12: Standby mode */
#define ANADIG_PMU_RBB_SOC_STBY_EN_SP_STBY_EN_SETPOINT13  (1 << 13)  /* Bit 13: Standby mode */
#define ANADIG_PMU_RBB_SOC_STBY_EN_SP_STBY_EN_SETPOINT14  (1 << 14)  /* Bit 14: Standby mode */
#define ANADIG_PMU_RBB_SOC_STBY_EN_SP_STBY_EN_SETPOINT15  (1 << 15)  /* Bit 15: Standby mode */

/* RBB_LPSR_STBY_EN_SP_REGISTER (RBB_LPSR_STBY_EN_SP) */
#define ANADIG_PMU_RBB_LPSR_STBY_EN_SP_STBY_EN_SETPOINT0   (1 << 0)   /* Bit 0: Standby mode */
#define ANADIG_PMU_RBB_LPSR_STBY_EN_SP_STBY_EN_SETPOINT1   (1 << 1)   /* Bit 1: Standby mode */
#define ANADIG_PMU_RBB_LPSR_STBY_EN_SP_STBY_EN_SETPOINT2   (1 << 2)   /* Bit 2: Standby mode */
#define ANADIG_PMU_RBB_LPSR_STBY_EN_SP_STBY_EN_SETPOINT3   (1 << 3)   /* Bit 3: Standby mode */
#define ANADIG_PMU_RBB_LPSR_STBY_EN_SP_STBY_EN_SETPOINT4   (1 << 4)   /* Bit 4: Standby mode */
#define ANADIG_PMU_RBB_LPSR_STBY_EN_SP_STBY_EN_SETPOINT5   (1 << 5)   /* Bit 5: Standby mode */
#define ANADIG_PMU_RBB_LPSR_STBY_EN_SP_STBY_EN_SETPOINT6   (1 << 6)   /* Bit 6: Standby mode */
#define ANADIG_PMU_RBB_LPSR_STBY_EN_SP_STBY_EN_SETPOINT7   (1 << 7)   /* Bit 7: Standby mode */
#define ANADIG_PMU_RBB_LPSR_STBY_EN_SP_STBY_EN_SETPOINT8   (1 << 8)   /* Bit 8: Standby mode */
#define ANADIG_PMU_RBB_LPSR_STBY_EN_SP_STBY_EN_SETPOINT9   (1 << 9)   /* Bit 9: Standby mode */
#define ANADIG_PMU_RBB_LPSR_STBY_EN_SP_STBY_EN_SETPOINT10  (1 << 10)  /* Bit 10: Standby mode */
#define ANADIG_PMU_RBB_LPSR_STBY_EN_SP_STBY_EN_SETPOINT11  (1 << 11)  /* Bit 11: Standby mode */
#define ANADIG_PMU_RBB_LPSR_STBY_EN_SP_STBY_EN_SETPOINT12  (1 << 12)  /* Bit 12: Standby mode */
#define ANADIG_PMU_RBB_LPSR_STBY_EN_SP_STBY_EN_SETPOINT13  (1 << 13)  /* Bit 13: Standby mode */
#define ANADIG_PMU_RBB_LPSR_STBY_EN_SP_STBY_EN_SETPOINT14  (1 << 14)  /* Bit 14: Standby mode */
#define ANADIG_PMU_RBB_LPSR_STBY_EN_SP_STBY_EN_SETPOINT15  (1 << 15)  /* Bit 15: Standby mode */

/* FBB_M7_CONFIGURE_REGISTER (FBB_M7_CONFIGURE) */
#define ANADIG_PMU_FBB_M7_CONFIGURE_WB_CFG_PW_SHIFT           (0)   /* Bits 0-4: wb_cfg_pw */
#define ANADIG_PMU_FBB_M7_CONFIGURE_WB_CFG_PW_MASK            (0xF << ANADIG_PMU_FBB_M7_CONFIGURE_WB_CFG_PW_SHIFT)
#define ANADIG_PMU_FBB_M7_CONFIGURE_WB_CFG_PW(n)              (((n) << ANADIG_PMU_FBB_M7_CONFIGURE_WB_CFG_PW_SHIFT) & ANADIG_PMU_FBB_M7_CONFIGURE_WB_CFG_PW_MASK)
#define ANADIG_PMU_FBB_M7_CONFIGURE_WB_CFG_NW_SHIFT           (4)   /* Bits 4-8: wb_cfg_nw */
#define ANADIG_PMU_FBB_M7_CONFIGURE_WB_CFG_NW_MASK            (0xF << ANADIG_PMU_FBB_M7_CONFIGURE_WB_CFG_NW_SHIFT)
#define ANADIG_PMU_FBB_M7_CONFIGURE_WB_CFG_NW(n)              (((n) << ANADIG_PMU_FBB_M7_CONFIGURE_WB_CFG_NW_SHIFT) & ANADIG_PMU_FBB_M7_CONFIGURE_WB_CFG_NW_MASK)
#define ANADIG_PMU_FBB_M7_CONFIGURE_OSCILLATOR_BITS_SHIFT     (8)   /* Bits 8-11: oscillator_bits */
#define ANADIG_PMU_FBB_M7_CONFIGURE_OSCILLATOR_BITS_MASK      (0x7 << ANADIG_PMU_FBB_M7_CONFIGURE_OSCILLATOR_BITS_SHIFT)
#define ANADIG_PMU_FBB_M7_CONFIGURE_OSCILLATOR_BITS(n)        (((n) << ANADIG_PMU_FBB_M7_CONFIGURE_OSCILLATOR_BITS_SHIFT) & ANADIG_PMU_FBB_M7_CONFIGURE_OSCILLATOR_BITS_MASK)
#define ANADIG_PMU_FBB_M7_CONFIGURE_REGULATOR_STRENGTH_SHIFT  (11)  /* Bits 11-14: regulator_strength */
#define ANADIG_PMU_FBB_M7_CONFIGURE_REGULATOR_STRENGTH_MASK   (0x7 << ANADIG_PMU_FBB_M7_CONFIGURE_REGULATOR_STRENGTH_SHIFT)
#define ANADIG_PMU_FBB_M7_CONFIGURE_REGULATOR_STRENGTH(n)     (((n) << ANADIG_PMU_FBB_M7_CONFIGURE_REGULATOR_STRENGTH_SHIFT) & ANADIG_PMU_FBB_M7_CONFIGURE_REGULATOR_STRENGTH_MASK)

/* RBB_LPSR_CONFIGURE_REGISTER (RBB_LPSR_CONFIGURE) */
#define ANADIG_PMU_RBB_LPSR_CONFIGURE_WB_CFG_PW_SHIFT           (0)   /* Bits 0-4: wb_cfg_pw */
#define ANADIG_PMU_RBB_LPSR_CONFIGURE_WB_CFG_PW_MASK            (0xF << ANADIG_PMU_RBB_LPSR_CONFIGURE_WB_CFG_PW_SHIFT)
#define ANADIG_PMU_RBB_LPSR_CONFIGURE_WB_CFG_PW(n)              (((n) << ANADIG_PMU_RBB_LPSR_CONFIGURE_WB_CFG_PW_SHIFT) & ANADIG_PMU_RBB_LPSR_CONFIGURE_WB_CFG_PW_MASK)
#define ANADIG_PMU_RBB_LPSR_CONFIGURE_WB_CFG_NW_SHIFT           (4)   /* Bits 4-8: wb_cfg_nw */
#define ANADIG_PMU_RBB_LPSR_CONFIGURE_WB_CFG_NW_MASK            (0xF << ANADIG_PMU_RBB_LPSR_CONFIGURE_WB_CFG_NW_SHIFT)
#define ANADIG_PMU_RBB_LPSR_CONFIGURE_WB_CFG_NW(n)              (((n) << ANADIG_PMU_RBB_LPSR_CONFIGURE_WB_CFG_NW_SHIFT) & ANADIG_PMU_RBB_LPSR_CONFIGURE_WB_CFG_NW_MASK)
#define ANADIG_PMU_RBB_LPSR_CONFIGURE_OSCILLATOR_BITS_SHIFT     (8)   /* Bits 8-11: oscillator_bits */
#define ANADIG_PMU_RBB_LPSR_CONFIGURE_OSCILLATOR_BITS_MASK      (0x7 << ANADIG_PMU_RBB_LPSR_CONFIGURE_OSCILLATOR_BITS_SHIFT)
#define ANADIG_PMU_RBB_LPSR_CONFIGURE_OSCILLATOR_BITS(n)        (((n) << ANADIG_PMU_RBB_LPSR_CONFIGURE_OSCILLATOR_BITS_SHIFT) & ANADIG_PMU_RBB_LPSR_CONFIGURE_OSCILLATOR_BITS_MASK)
#define ANADIG_PMU_RBB_LPSR_CONFIGURE_REGULATOR_STRENGTH_SHIFT  (11)  /* Bits 11-14: regulator_strength */
#define ANADIG_PMU_RBB_LPSR_CONFIGURE_REGULATOR_STRENGTH_MASK   (0x7 << ANADIG_PMU_RBB_LPSR_CONFIGURE_REGULATOR_STRENGTH_SHIFT)
#define ANADIG_PMU_RBB_LPSR_CONFIGURE_REGULATOR_STRENGTH(n)     (((n) << ANADIG_PMU_RBB_LPSR_CONFIGURE_REGULATOR_STRENGTH_SHIFT) & ANADIG_PMU_RBB_LPSR_CONFIGURE_REGULATOR_STRENGTH_MASK)

